BUILD/doc/source/_static/soap_outputs/6.5.314.4301/deploy_action_with_params_against_windows_computers_step_6_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>GetObject</command>
      <object_list>
        <saved_actions>
          <saved_action>
            <comment>Created by PyTan v2.1.4</comment>
            <status>0</status>
            <expire_seconds>660</expire_seconds>
            <user_start_time>2001-01-01T00:00:00</user_start_time>
            <name>API Deploy Custom Tagging - Add Tags</name>
            <distribute_seconds>0</distribute_seconds>
            <creation_time>2015-09-14T19:58:42</creation_time>
            <start_time>2015-09-14T19:58:42</start_time>
            <public_flag>0</public_flag>
            <issue_count>0</issue_count>
            <action_group_id>0</action_group_id>
            <next_start_time>Never</next_start_time>
            <policy_flag>0</policy_flag>
            <last_start_time>Never</last_start_time>
            <end_time>Never</end_time>
            <issue_seconds>0</issue_seconds>
            <approved_flag>1</approved_flag>
            <id>81</id>
            <approver>
              <name>Administrator</name>
              <id>1</id>
            </approver>
            <last_action>
              <start_time>Never</start_time>
              <id>82</id>
              <target_group>
                <id>302</id>
              </target_group>
            </last_action>
            <user>
              <name>Administrator</name>
              <id>1</id>
            </user>
            <package_spec>
              <name>Custom Tagging - Add Tags</name>
              <id>97</id>
            </package_spec>
          </saved_action>
        </saved_actions>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>